# სია, რომელიც შეიცავს 10 ელემენტს
my_list = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

# მომხმარებლისთვის რიცხვის შეყვანა
user_input = input("შეიყვანეთ მთელი რიცხვი: ")

# რიცხვი მთლად ინტეგერში კონვერტირება
try:
    index = int(user_input)

    # თუ რიცხვი მეტია ან ტოლია 0-ზე და ნაკლებია სიის სიგრძეზე
    if 0 <= index < len(my_list):
        print(f"სიის ინდექსზე {index} ელემენტი არის: {my_list[index]}")
    
    # თუ რიცხვი მეტია ან ტოლია სიის სიგრძის გამრავლებული -1-ზე და ნაკლებია ან ტოლია -1 ზე
    elif len(my_list) - 1 >= index >= -1:
        print(f"სიის ინდექსზე {index} ელემენტი არის: {my_list[index]}")
    
    else:
        print("შეიყვანეთ სწორი ინდექსი.")
except ValueError:
    print("გთხოვთ, შეიყვანოთ მთელი რიცხვი.")